
titles_ = []

while True: # Цикл для создания нескольких заголовок
    x = input('Введите заголовок заметки (или оставьте пустым для завершения): ').strip() # Ввод заголовка с удалением пробелов в начале и в конце при помощи strip()
    if x == '':
        break # Данное условие останавливает ввод заголвоков если введена пустая строка
    if x != '':
        titles_.append(x) # Если введена не пустая строка то заголовок добавляется в список titles_

print('Заголовки заметки:')
for i in range(len(titles_)):
    print(f'- {titles_[i]}') # Цикл для вывода всех заголовков

